In [1]:
!pip install pandas

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in d:\anaconda\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import numpy as np

In [5]:
import pandas as pd

In [3]:
arr = np.random.randint(10,100, size=(6,4))

In [4]:
arr

array([[15, 82, 56, 39],
       [26, 81, 94, 39],
       [78, 38, 62, 45],
       [84, 17, 89, 46],
       [98, 56, 26, 92],
       [40, 78, 97, 42]])

In [6]:
df = pd.DataFrame(data=arr)

In [7]:
df

    0   1   2   3
0  15  82  56  39
1  26  81  94  39
2  78  38  62  45
3  84  17  89  46
4  98  56  26  92
5  40  78  97  42

In [8]:
print(df)

    0   1   2   3
0  15  82  56  39
1  26  81  94  39
2  78  38  62  45
3  84  17  89  46
4  98  56  26  92
5  40  78  97  42

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df[2]

0    56
1    94
2    62
3    89
4    26
5    97
Name: 2, dtype: int32

In [11]:
df[:2]

    0   1   2   3
0  15  82  56  39
1  26  81  94  39

In [12]:
df.columns = ['A', 'B', 'C', 'D']

In [13]:
df

    A   B   C   D
0  15  82  56  39
1  26  81  94  39
2  78  38  62  45
3  84  17  89  46
4  98  56  26  92
5  40  78  97  42

In [15]:
df[:0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [16]:
df.head()

    A   B   C   D
0  15  82  56  39
1  26  81  94  39
2  78  38  62  45
3  84  17  89  46
4  98  56  26  92

In [17]:
df['A+B'] = df['A'] + df['B']

In [18]:
df

    A   B   C   D  A+B
0  15  82  56  39   97
1  26  81  94  39  107
2  78  38  62  45  116
3  84  17  89  46  101
4  98  56  26  92  154
5  40  78  97  42  118

In [19]:
df.iloc[2]

A       78
B       38
C       62
D       45
A+B    116
Name: 2, dtype: int32

In [25]:
#Masking

In [27]:
mask = df > 30

In [28]:
df[mask]

      A     B     C   D  A+B
0   NaN  82.0  56.0  39   97
1   NaN  81.0  94.0  39  107
2  78.0  38.0  62.0  45  116
3  84.0   NaN  89.0  46  101
4  98.0  56.0   NaN  92  154
5  40.0  78.0  97.0  42  118